src/wsdl/demInterrogaNreUtilizzati.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:ricevutans="http://interroganreutilricevuta.xsd.dem.sanita.finanze.it" xmlns:richiestans="http://interroganreutilrichiesta.xsd.dem.sanita.finanze.it" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://interroganreutilizzati.wsdl.dem.sanita.finanze.it" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://interroganreutilizzati.wsdl.dem.sanita.finanze.it">
	<wsdl:types>
		<xsd:schema elementFormDefault="qualified">
			<xsd:import namespace="http://interroganreutilrichiesta.xsd.dem.sanita.finanze.it" schemaLocation="InterrogaNreUtilRichiesta.xsd"/>
		</xsd:schema>
		<xsd:schema elementFormDefault="qualified">
			<xsd:import namespace="http://interroganreutilricevuta.xsd.dem.sanita.finanze.it" schemaLocation="InterrogaNreUtilRicevuta.xsd"/>
		</xsd:schema>
	</wsdl:types>
	<wsdl:message name="ricevuta">
		<wsdl:part name="InterrogaNreUtilRicevuta" element="ricevutans:InterrogaNreUtilRicevuta"/>
	</wsdl:message>
	<wsdl:message name="richiesta">
		<wsdl:part name="InterrogaNreUtilRichiesta" element="richiestans:InterrogaNreUtilRichiesta"/>
	</wsdl:message>
	<wsdl:portType name="interrogaNreUtilizzatiPT">
		<wsdl:operation name="interrogaNreUtilizzati">
			<wsdl:input message="tns:richiesta"/>
			<wsdl:output message="tns:ricevuta"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="interrogaNreUtilizzatiBinding" type="tns:interrogaNreUtilizzatiPT">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="interrogaNreUtilizzati">
			<soap:operation soapAction="http://interroganreassociati.wsdl.dem.sanita.finanze.it/InterrogaNreUtilizzati"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="demInterrogaNreUtilizzati">
		<wsdl:port name="demInterrogaNreUtilizzati" binding="tns:interrogaNreUtilizzatiBinding">
			<soap:address location="http://localhost:9080/DemRicettaInterrogazioniServicesWeb/services/demInterrogaNreUtilizzati"/>
		</wsdl:port>
	</wsdl:service>
	<wsdl:documentation>Versione 1.2</wsdl:documentation>
</wsdl:definitions>
